Revit 2027 API
ParameterTypeId.StructuralBeamEnd1Elevation Property
 "End Level Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralBeamEnd1Elevation { get; }
Public Shared ReadOnly Property StructuralBeamEnd1Elevation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralBeamEnd1Elevation {
	ForgeTypeId^ get ();
}
static member StructuralBeamEnd1Elevation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace